tests/WebformulierenVerwerker/scenario05/CorsaQueryRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <bct:QueryExecute xmlns:bct="http://bct.nl">
         <bct:ObjectType>P</bct:ObjectType>
         <bct:QueryItems>
            <bct:QueryItem>
               <bct:RubricType>qrtReference</bct:RubricType>
               <bct:RubricID>BRSpSofi</bct:RubricID>
               <bct:Condition>qcAnd</bct:Condition>
               <bct:Operator>qoEqual</bct:Operator>
               <bct:Value>123456789</bct:Value>
            </bct:QueryItem>
         </bct:QueryItems>
         <bct:SkipEmptyConditions>false</bct:SkipEmptyConditions>
         <bct:SearchByQueryOrder>false</bct:SearchByQueryOrder>
         <bct:SearchSubFolders>false</bct:SearchSubFolders>
         <bct:SearchRelated>false</bct:SearchRelated>
         <bct:SearchRecursive>true</bct:SearchRecursive>
         <bct:ReturnIDsOnly>true</bct:ReturnIDsOnly>
         <bct:MaxResult>1</bct:MaxResult>
      </bct:QueryExecute>
   </soapenv:Body>
</soapenv:Envelope>